using PropertyTools.DataAnnotations;

namespace VentWPF.Model
{
    public enum SizeType
    {
        ТипоРазмер1, //0 - 1200 550 420
        ТипоРазмер2, //1200 - 2200 650 550
        ТипоРазмер3, //2200 - 3200 750 550
        ТипоРазмер4, //3200 - 4200 900 550
        ТипоРазмер5, //4200 - 5200 950 650
        ТипоРазмер6, //5200 - 6500 1050 700
        ТипоРазмер8, //6500 - 7200 7750 700
        ТипоРазмер10,// 7200 - 9700 1150 1070
        ТипоРазмер12,// 9700 - 12000 1150 1330
        ТипоРазмер16,// 12000 - 15000 1250 1330
        ТипоРазмер20,// 15000 - 20300 1350 1450
        ТипоРазмер25,// 20300 - 25000 1600 1550
        ТипоРазмер30,// 25000 - 30000 1600 1550
        ТипоРазмер40,// 30000 - 40000 1860 1930
        ТипоРазмер50,// 40000 - 50000 2400 1930
        ТипоРазмер60,// 50000 - 60000 2400 2600
        ТипоРазмер80,// 60000 - 70000 2600 2600
        ТипоРазмер100,//0 70000 - inf 3680 3600
    }

    public static class SizeTypeExtention
    {
        public static (int, int) GetSize(this SizeType st)
        {
            return st switch
            {
                SizeType.ТипоРазмер1 => (550, 420),
                SizeType.ТипоРазмер2 => (650, 550),
                SizeType.ТипоРазмер3 => (750, 550),
                SizeType.ТипоРазмер4 => (900, 550),
                SizeType.ТипоРазмер5 => (950, 650),
                SizeType.ТипоРазмер6 => (1050, 700),
                SizeType.ТипоРазмер8 => (7750, 700),
                SizeType.ТипоРазмер10 => (1150, 1070),
                SizeType.ТипоРазмер12 => (1150, 1330),
                SizeType.ТипоРазмер16 => (1250, 1330),
                SizeType.ТипоРазмер20 => (1350, 1450),
                SizeType.ТипоРазмер25 => (1600, 1550),
                SizeType.ТипоРазмер30 => (1600, 1550),
                SizeType.ТипоРазмер40 => (1860, 1930),
                SizeType.ТипоРазмер50 => (2400, 1930),
                SizeType.ТипоРазмер60 => (2400, 2600),
                SizeType.ТипоРазмер80 => (2600, 2600),
                SizeType.ТипоРазмер100 => (3680, 3600),
                _ => (1, 1)
            };
        }
    }
}